> Thanks @rohit93c , I noticed that you are using "Windows" as the os_type in app_service_plan resource:
> 
> ```
> resource "azurerm_service_plan" "example" {
>   name                = "${var.prefix}-sp"
>   location            = azurerm_resource_group.example.location
>   resource_group_name = azurerm_resource_group.example.name
>   os_type             = "Windows"
>   sku_name            = "P1v3"
> }
> ```
> 
> Can you try `WindowsContainer`?



Tried with : os_type  = "WindowsContainer"
```
terraform apply -auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.appplan.azurerm_service_plan.az_app_plan will be created
  + resource "azurerm_service_plan" "az_app_plan" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "westeurope"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "mywebplan"
      + os_type                      = "WindowsContainer"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "myrg"
      + sku_name                     = "P1v3"      
      + worker_count                 = (known after apply)
    }

  # module.rg.azurerm_resource_group.az_rg will be created
  + resource "azurerm_resource_group" "az_rg" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "myrg"
          }

  # module.webapp_container_win.azurerm_role_assignment.az_role_assign will be created
  + resource "azurerm_role_assignment" "az_role_assign" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/mysubscription/resourceGroups/myacrrg/providers/Microsoft.ContainerRegistry/registries/myacr"
      + skip_service_principal_aad_check = true
    }

  # module.webapp_container_win.azurerm_windows_web_app.az_win_web_app will be created
  + resource "azurerm_windows_web_app" "az_win_web_app" {
      + app_settings                      = {
          + "WEBSITES_ENABLE_APP_SERVICE_STORAGE"  = "false"
        }
      + client_affinity_enabled           = false
      + client_certificate_enabled        = false
      + client_certificate_mode           = "Required"
      + custom_domain_verification_id     = (sensitive value)
      + default_hostname                  = (known after apply)
      + enabled                           = true
      + https_only                        = true
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + kind                              = (known after apply)
      + location                          = "westeurope"
      + name                              = "mywebcontainer"
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + resource_group_name               = "myrg"
      + service_plan_id                   = (known after apply)
      + site_credential                   = (known after apply)
      + zip_deploy_file                   = (known after apply)

      + auth_settings {
          + additional_login_parameters    = (known after apply)
          + allowed_external_redirect_urls = (known after apply)
          + default_provider               = (known after apply)
          + enabled                        = (known after apply)
          + issuer                         = (known after apply)
          + runtime_version                = (known after apply)
          + token_refresh_extension_hours  = (known after apply)
          + token_store_enabled            = (known after apply)
          + unauthenticated_client_action  = (known after apply)

          + active_directory {
              + allowed_audiences          = (known after apply)
              + client_id                  = (known after apply)
              + client_secret              = (sensitive value)
              + client_secret_setting_name = (known after apply)
            }

          + facebook {
              + app_id                  = (known after apply)
              + app_secret              = (sensitive value)
              + app_secret_setting_name = (known after apply)
              + oauth_scopes            = (known after apply)
            }

          + github {
              + client_id                  = (known after apply)
              + client_secret              = (sensitive value)
              + client_secret_setting_name = (known after apply)
              + oauth_scopes               = (known after apply)
            }

          + google {
              + client_id                  = (known after apply)
              + client_secret              = (sensitive value)
              + client_secret_setting_name = (known after apply)
              + oauth_scopes               = (known after apply)
            }

          + microsoft {
              + client_id                  = (known after apply)
              + client_secret              = (sensitive value)
              + client_secret_setting_name = (known after apply)
              + oauth_scopes               = (known after apply)
            }

          + twitter {
              + consumer_key                 = (known after apply)
              + consumer_secret              = (sensitive value)
              + consumer_secret_setting_name = (known after apply)
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + auto_heal_enabled                       = false
          + container_registry_use_managed_identity = true
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = (known after apply)
          + http2_enabled                           = false
          + ip_restriction                          = (known after apply)
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction                      = (known after apply)
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + windows_fx_version                      = (known after apply)
          + worker_count                            = (known after apply)

          + application_stack {
              + docker_container_name     = "nano"
              + docker_container_registry = "myacr.azurecr.io"
              + docker_container_tag      = "latest"
            }
        }
    }

```

Getting error: access denied to azure container registry
```
Plan: 4 to add, 0 to change, 0 to destroy.
module.rg.azurerm_resource_group.az_rg: Creating...
module.rg.azurerm_resource_group.az_rg: Creation complete after 4s [id=/subscriptions/mysubscription/resourceGroups/myrg]
module.appplan.azurerm_service_plan.az_app_plan: Creating...
module.appplan.azurerm_service_plan.az_app_plan: Still creating... [10s elapsed]
module.appplan.azurerm_service_plan.az_app_plan: Creation complete after 14s [id=/subscriptions/mysubscription/resourceGroups/myrg/providers/Microsoft.Web/serverfarms/mywebplan]
module.webapp_container_win.azurerm_windows_web_app.az_win_web_app: Creating...
module.webapp_container_win.azurerm_windows_web_app.az_win_web_app: Still creating... [10s elapsed]
module.webapp_container_win.azurerm_windows_web_app.az_win_web_app: Still creating... [20s elapsed]
╷
│ Error: creating Windows Web App: (Site Name "mywebcontainer" / Resource Group "myrg"): web.AppsClient#CreateOrUpdate: Failure sending request: StatusCode=401 -- Original Error: Code="Unauthorized" Message="Access is denied. Not authorized. https://myacr.azurecr.io/" Details=[{"Message":"Access is denied. Not authorized. https://myacr.azurecr.io/"},{"Code":"Unauthorized"},{"ErrorEntity":{"Code":"Unauthorized","ExtendedCode":"01001","Message":"Access is denied. Not authorized. https://myacr.azurecr.io/","MessageTemplate":"Access is denied.","Parameters":[]}}]
│
│   with module.webapp_container_win.azurerm_windows_web_app.az_win_web_app,
│   on ..\azr-iac-module-webcontainer-win\main.tf line 16, in resource "azurerm_windows_web_app" "az_win_web_app":
│   16: resource "azurerm_windows_web_app" "az_win_web_app" {
│
│ creating Windows Web App: (Site Name "mywebcontainer" / Resource Group "myrg"): web.AppsClient#CreateOrUpdate: Failure sending request:       
│ StatusCode=401 -- Original Error: Code="Unauthorized" Message="Access is denied. Not authorized. https://myacr.azurecr.io/"
│ Details=[{"Message":"Access is denied. Not authorized.
│ https://myacr.azurecr.io/"},{"Code":"Unauthorized"},{"ErrorEntity":{"Code":"Unauthorized","ExtendedCode":"01001","Message":"Access is denied. Not    
│ authorized. https://myacr.azurecr.io/","MessageTemplate":"Access is denied.","Parameters":[]}}]

```